app/controllers/songs_controller.rb

  def show
    if params[:artist_id]
      begin
       artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 2]]