app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? ORDER BY "artists"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs"
SELECT  "artists".* FROM "artists" WHERE (6) LIMIT ?  [["LIMIT", 1]]
SELECT COUNT(*) FROM "artists" WHERE "artists"."id" = ?  [["id", 0]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
  def index
    @artist = Artist.where(id: params[:artist_id])
    if params[:artist_id].blank?
      @songs = Song.all
    elsif !@artist.empty?
      # binding.pry
      @songs = @artist.first.songs

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? ORDER BY "songs"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE (12345)
SELECT COUNT(*) FROM "songs" WHERE "songs"."id" = ?  [["id", 12345]]
---
  def show
    @song = Song.where(id: params[:id])
    if !@song.empty?

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
---
  def edit
    @song = Song.find(params[:id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 17], ["LIMIT", 1]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 6], ["updated_at", "2020-10-05 06:51:35.960504"], ["id", 17]]
---
  def update
    @song = Song.find(params[:id])

    @song.update(song_params)